# ![](https://ga-dash.s3.amazonaws.com/production/assets/logo-9f88ae6c9c3871690e33280fcf557f33.png)

# Project 1: Standardized Test Analysis

# Problem Statement

College applications are a stressful process that each high school students need to go through if they want to pursue higher education. With all the requirements and actual work demanded from students, it's easy to be unsure or even a little bit lost.
My job is to guide students, help them understand the process, especially when it comes to standardized tests (SAT and ACT).
Based on aquired data and a thorough analysis, I'll tell the students what grades they need to obtain and which are the ideal colleges they should apply to according to the majors they pick.

# Contents:
- Background
- Data Import & Cleaning
- Exploratory Data Analysis
- Data Visualization
- Conclusions and Recommendations

# Background
The SAT and ACT are standardized tests that many colleges and universities in the United States require for their admissions process. This score is used along with other materials such as grade point average (GPA) and essay responses to determine whether or not a potential student will be accepted to the university.

The SAT has two sections of the test: Evidence-Based Reading and Writing and Math (source). The ACT has 4 sections: English, Mathematics, Reading, and Science, with an additional optional writing section (source). They have different score ranges, which you can read more about on their websites or additional outside sources (a quick Google search will help you understand the scores for each test):

SAT
ACT
Standardized tests have long been a controversial topic for students, administrators, and legislators. Since the 1940's, an increasing number of colleges have been using scores from sudents' performances on tests like the SAT and the ACT as a measure for college readiness and aptitude (source). Supporters of these tests argue that these scores can be used as an objective measure to determine college admittance. Opponents of these tests claim that these tests are not accurate measures of students potential or ability and serve as an inequitable barrier to entry. Lately, more and more schools are opting to drop the SAT/ACT requirement for their Fall 2021 applications.

# Data

- sat_act_by_college.csv: Ranges of Accepted ACT & SAT Scores by Colleges
- sat_2019_by_intended_college_major.csv : A list of college majors, the number of applicants and their average SAT scores

The sat_2019 file is the participation rate and SAT scores by states in the year 2019.

The sat_act_by_college file provide a list of colleges and their application policies, if the tests are optional, their number of applicants and their acceptance rate. It also provide each college 25th and 75th percentile for both the SAT and ACT.

# Outside Research

# Data Import & Cleaning

The first step is to import and read the data

In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

The first dataframe I work on is the sat_act_by_college.csv

In [2]:
college_set = pd.read_csv('data/sat_act_by_college.csv')

In [3]:
df_1 = college_set

In [4]:
df_1.head(5)

,School,Test Optional?,Applies to Class Year(s),Policy Details,Number of Applicants,Accept Rate,SAT Total 25th-75th Percentile,ACT Total 25th-75th Percentile
0,Stanford University,Yes,2021,Stanford has adopted a one-year test optional ...,47452,4.3%,1440-1570,32-35
1,Harvard College,Yes,2021,Harvard has adopted a one-year test optional p...,42749,4.7%,1460-1580,33-35
2,Princeton University,Yes,2021,Princeton has adopted a one-year test optional...,35370,5.5%,1440-1570,32-35
3,Columbia University,Yes,2021,Columbia has adopted a one-year test optional ...,40203,5.5%,1450-1560,33-35
4,Yale University,Yes,2021,Yale has adopted a one-year test optional poli...,36844,6.1%,1460-1570,33-35

I check for missing values

In [5]:
df_1.isnull().sum()

School                             0
Test Optional?                     0
Applies to Class Year(s)          26
Policy Details                     0
Number of Applicants               0
Accept Rate                        0
SAT Total 25th-75th Percentile     0
ACT Total 25th-75th Percentile     0
dtype: int64

26 missing values for the 'Applies to class year(s) columns'

I change the columns names to use the isunique method. I want to see the different values in that column containing missing values

In [6]:
new_columns = {str(col) : str(col).lower().replace(' ', '_') for col in df_1.columns}

df_1.rename(columns= new_columns, inplace=True)

df_1.columns

Index(['school', 'test_optional?', 'applies_to_class_year(s)',
       'policy_details', 'number_of_applicants', 'accept_rate',
       'sat_total_25th-75th_percentile', 'act_total_25th-75th_percentile'],
      dtype='object')

I still got some special characters that I want to remove

In [7]:
df_1.rename( columns = {'test optional?':'test_optional','applies_to_class_year(s)': 'applies_to_class_years',
                        'sat_total_25th-75th_percentile': 'sat_total_25th_75th_percentile',
                        'act_total_25th-75th_percentile': 'act_total_25th_75th_percentile'} , inplace = True)

In [8]:
df_1.head(5)

,school,test_optional?,applies_to_class_years,policy_details,number_of_applicants,accept_rate,sat_total_25th_75th_percentile,act_total_25th_75th_percentile
0,Stanford University,Yes,2021,Stanford has adopted a one-year test optional ...,47452,4.3%,1440-1570,32-35
1,Harvard College,Yes,2021,Harvard has adopted a one-year test optional p...,42749,4.7%,1460-1580,33-35
2,Princeton University,Yes,2021,Princeton has adopted a one-year test optional...,35370,5.5%,1440-1570,32-35
3,Columbia University,Yes,2021,Columbia has adopted a one-year test optional ...,40203,5.5%,1450-1560,33-35
4,Yale University,Yes,2021,Yale has adopted a one-year test optional poli...,36844,6.1%,1460-1570,33-35

I still have a question mark for the test optional? column; I realize my mistake and fix the code

In [9]:
df_1.rename( columns = {'test_optional?':'test_optional'} , inplace = True)

In [10]:
df_1.head(2)

,school,test_optional,applies_to_class_years,policy_details,number_of_applicants,accept_rate,sat_total_25th_75th_percentile,act_total_25th_75th_percentile
0,Stanford University,Yes,2021,Stanford has adopted a one-year test optional ...,47452,4.3%,1440-1570,32-35
1,Harvard College,Yes,2021,Harvard has adopted a one-year test optional p...,42749,4.7%,1460-1580,33-35

The names of all columns are lowercased and the space has been replaced by an underscore

Now I can check the unique values of the applies_to_class_years column

In [11]:
df_1.applies_to_class_years.unique()

array(['2021', '2021 2022', 'All / Permanent Policy',
       '2021 2022 2023 2024', '2021 2022 2023',
       '2021 2022 2023 2024 2025', nan], dtype=object)

2021 is not a the unique value but I can deduct that the missing values could be replaced by 2021 because all the other values start at least with that year

In [12]:
df_1 = df_1.fillna(2021)

In [13]:
df_1.isnull().sum()

school                            0
test_optional                     0
applies_to_class_years            0
policy_details                    0
number_of_applicants              0
accept_rate                       0
sat_total_25th_75th_percentile    0
act_total_25th_75th_percentile    0
dtype: int64

There are no other null values.

I check the type of each columns

In [14]:
df_1.dtypes

school                            object
test_optional                     object
applies_to_class_years            object
policy_details                    object
number_of_applicants               int64
accept_rate                       object
sat_total_25th_75th_percentile    object
act_total_25th_75th_percentile    object
dtype: object

I change the accept rate type from strings with '%' to percentage in float

In [15]:
df_1['accept_rate'].replace('%','',regex=True, inplace = True)

In [16]:
df_1['accept_rate'] = df_1['accept_rate'].astype(float)

In [17]:
df_1['accept_rate'] = df_1['accept_rate'].div(100)

In [18]:
df_1.head(5)

,school,test_optional,applies_to_class_years,policy_details,number_of_applicants,accept_rate,sat_total_25th_75th_percentile,act_total_25th_75th_percentile
0,Stanford University,Yes,2021,Stanford has adopted a one-year test optional ...,47452,0.043,1440-1570,32-35
1,Harvard College,Yes,2021,Harvard has adopted a one-year test optional p...,42749,0.047,1460-1580,33-35
2,Princeton University,Yes,2021,Princeton has adopted a one-year test optional...,35370,0.055,1440-1570,32-35
3,Columbia University,Yes,2021,Columbia has adopted a one-year test optional ...,40203,0.055,1450-1560,33-35
4,Yale University,Yes,2021,Yale has adopted a one-year test optional poli...,36844,0.061,1460-1570,33-35

The accept rate format is correct

Now I format the SAT and ACT percentile columns by separating them into two different columns for each and turning them into float type. To separate the 25th and 75th percentile columns; I create two temporary dataframes: sat_percentile_dividersat_percentile_divider and act_percentile_divider

In [19]:
sat_percentile_divider = df_1['sat_total_25th_75th_percentile'].str.split('-', expand=True)

In [20]:
sat_percentile_divider.head()

      0     1     2
0  1440  1570  None
1  1460  1580  None
2  1440  1570  None
3  1450  1560  None
4  1460  1570  None

I change the column name of these divided columns before I join them to the big dataframe

In [26]:
sat_percentile_divider.rename(columns = {0: 'sat_total_25th_percentile', 1: 'sat_total_75th_percentile' }, inplace=True)

Let's remove the column named 2

In [24]:
sat_percentile_divider.drop(columns = 2, inplace= True)

In [27]:
sat_percentile_divider

    sat_total_25th_percentile sat_total_75th_percentile
0                        1440                      1570
1                        1460                      1580
2                        1440                      1570
3                        1450                      1560
4                        1460                      1570
..                        ...                       ...
411                       950                      1130
412                       990                      1180
413                      1050                      1270
414                      1060                      1280
415                       820                      1050

[416 rows x 2 columns]

let's change the type to float as well

to do this I must get rid of a special character (\u200b\u200b)

In [28]:
sat_percentile_divider.replace('(\u200b\u200b)','',regex=True, inplace = True)

There is another special character  ''  that I need to remove to convert the data into float

In [41]:
 sat_percentile_divider = sat_percentile_divider[sat_percentile_divider['sat_total_25th_percentile'] != '']

In [42]:
 sat_percentile_divider = sat_percentile_divider[sat_percentile_divider['sat_total_75th_percentile'] != '']

We finally can do the conversion

In [43]:
 sat_percentile_divider['sat_total_25th_percentile'] =  sat_percentile_divider['sat_total_25th_percentile'].astype('float')

In [44]:
sat_percentile_divider['sat_total_75th_percentile'] =  sat_percentile_divider['sat_total_75th_percentile'].astype('float')

Let's join this dataframe to the main dataframe df_1

In [45]:
df_1 = df_1.join(sat_percentile_divider)

In [47]:
df_1.head(2)

,school,test_optional,applies_to_class_years,policy_details,number_of_applicants,accept_rate,sat_total_25th_75th_percentile,act_total_25th_75th_percentile,sat_total_25th_percentile,sat_total_75th_percentile
0,Stanford University,Yes,2021,Stanford has adopted a one-year test optional ...,47452,0.043,1440-1570,32-35,1440.0,1570.0
1,Harvard College,Yes,2021,Harvard has adopted a one-year test optional p...,42749,0.047,1460-1580,33-35,1460.0,1580.0

As seen above; I have two new columns which are the SAT 25th and 75th percentile separated; I can now drop the SAT column where the percentile are combined.

In [48]:
df_1.drop(columns = 'sat_total_25th_75th_percentile', inplace=True)

Let's repeat this entire process for the ACT percentile column. First separate it and then change the type to float with removal of special characters

In [51]:
act_percentile_divider = df_1['act_total_25th_75th_percentile'].str.split('-', expand=True)

In [53]:
act_percentile_divider.head()

    0   1     2
0  32  35  None
1  33  35  None
2  32  35  None
3  33  35  None
4  33  35  None

Separated the column in two in a new dataframe

I rename the columns

In [54]:
act_percentile_divider.rename(columns = {0: 'act_total_25th_percentile', 1: 'act_total_75th_percentile' }, inplace=True)

In [55]:
act_percentile_divider.head(2)

  act_total_25th_percentile act_total_75th_percentile     2
0                        32                        35  None
1                        33                        35  None

I have renamed the columns; now I drop the column 2

In [56]:
act_percentile_divider.drop(columns = 2 , inplace = True)

Now let's take care of the data type; I need to check if there are any special characters first

In [58]:
act_percentile_divider['act_total_25th_percentile'].unique()

array(['32', '33', '35', '34', '31', '29', '27', '30', '28', '26', '',
       '25', '22', '19', '15', '20', '24', '23', '21', '16', '17', '18',
       '19.3'], dtype=object)

one value is equal to '' here; I remove it

In [59]:
 act_percentile_divider = act_percentile_divider[act_percentile_divider['act_total_25th_percentile'] != '']

In [60]:
act_percentile_divider = act_percentile_divider[act_percentile_divider['act_total_75th_percentile'] != '']

In [61]:
act_percentile_divider['act_total_25th_percentile'].unique()

array(['32', '33', '35', '34', '31', '29', '27', '30', '28', '26', '25',
       '22', '19', '15', '20', '24', '23', '21', '16', '17', '18', '19.3'],
      dtype=object)

No more '' !

Let's convert the two ACT columns into float

In [62]:
act_percentile_divider['act_total_25th_percentile'] =  act_percentile_divider['act_total_25th_percentile'].astype('float')

In [63]:
act_percentile_divider['act_total_75th_percentile'] =  act_percentile_divider['act_total_75th_percentile'].astype('float')

Let's join this ACT divider dataframe to the main dataframe df_1

In [64]:
df_1 = df_1.join(act_percentile_divider)

In [66]:
df_1.head(2)

,school,test_optional,applies_to_class_years,policy_details,number_of_applicants,accept_rate,act_total_25th_75th_percentile,sat_total_25th_percentile,sat_total_75th_percentile,act_total_25th_percentile,act_total_75th_percentile
0,Stanford University,Yes,2021,Stanford has adopted a one-year test optional ...,47452,0.043,32-35,1440.0,1570.0,32.0,35.0
1,Harvard College,Yes,2021,Harvard has adopted a one-year test optional p...,42749,0.047,33-35,1460.0,1580.0,33.0,35.0

Now that we have the separated act percentile columns, let's drop the act combined percentile column

In [67]:
df_1.drop(columns = 'act_total_25th_75th_percentile', inplace = True )

In [68]:
df_1.head(2)

,school,test_optional,applies_to_class_years,policy_details,number_of_applicants,accept_rate,sat_total_25th_percentile,sat_total_75th_percentile,act_total_25th_percentile,act_total_75th_percentile
0,Stanford University,Yes,2021,Stanford has adopted a one-year test optional ...,47452,0.043,1440.0,1570.0,32.0,35.0
1,Harvard College,Yes,2021,Harvard has adopted a one-year test optional p...,42749,0.047,1460.0,1580.0,33.0,35.0

In [70]:
df_1.dtypes

school                        object
test_optional                 object
applies_to_class_years        object
policy_details                object
number_of_applicants           int64
accept_rate                  float64
sat_total_25th_percentile    float64
sat_total_75th_percentile    float64
act_total_25th_percentile    float64
act_total_75th_percentile    float64
dtype: object

Let's turn the test optional column into a boolean

In [71]:
df_1['test_is_optional'] = np.where(df_1['test_optional'].str.contains('Yes'), 1, 0)

In [72]:
df_1.head(2)

,school,test_optional,applies_to_class_years,policy_details,number_of_applicants,accept_rate,sat_total_25th_percentile,sat_total_75th_percentile,act_total_25th_percentile,act_total_75th_percentile,test_is_optional
0,Stanford University,Yes,2021,Stanford has adopted a one-year test optional ...,47452,0.043,1440.0,1570.0,32.0,35.0,1
1,Harvard College,Yes,2021,Harvard has adopted a one-year test optional p...,42749,0.047,1460.0,1580.0,33.0,35.0,1

Now there are two columns with test optional; let's get rid of the one with string to avoid redundancy

In [73]:
df_1.drop(columns = 'test_optional', inplace = True)

In [74]:
df_1.isnull().sum()

school                       0
applies_to_class_years       0
policy_details               0
number_of_applicants         0
accept_rate                  0
sat_total_25th_percentile    6
sat_total_75th_percentile    6
act_total_25th_percentile    6
act_total_75th_percentile    6
test_is_optional             0
dtype: int64

As seen above; There are some missing values for the sat and act percentile columns. I drop these rows for conveniency

In [75]:
df_1.dropna(inplace=True)

In [76]:
df_1.head()

,school,applies_to_class_years,policy_details,number_of_applicants,accept_rate,sat_total_25th_percentile,sat_total_75th_percentile,act_total_25th_percentile,act_total_75th_percentile,test_is_optional
0,Stanford University,2021,Stanford has adopted a one-year test optional ...,47452,0.043,1440.0,1570.0,32.0,35.0,1
1,Harvard College,2021,Harvard has adopted a one-year test optional p...,42749,0.047,1460.0,1580.0,33.0,35.0,1
2,Princeton University,2021,Princeton has adopted a one-year test optional...,35370,0.055,1440.0,1570.0,32.0,35.0,1
3,Columbia University,2021,Columbia has adopted a one-year test optional ...,40203,0.055,1450.0,1560.0,33.0,35.0,1
4,Yale University,2021,Yale has adopted a one-year test optional poli...,36844,0.061,1460.0,1570.0,33.0,35.0,1

Now let's save this dataframe to a csv file

In [ ]:
df.to_csv('output-folder/'+file, index=False)

In [79]:
df_1.to_csv('data/college_sat_new.csv')

Now let's clean the second dataframe !

first let's import and read it

In [80]:
majors = pd.read_csv('data/sat_2019_by_intended_college_major.csv')

In [93]:
df2 = majors 
df2.head(5)

,intended_college_major,test_takers,percent,total,reading_writing,math
0,"Agriculture, AgricultureOperations, and Relate...","24,913",1%,977,496,481
1,Architecture and Related Services,"28,988",2%,1047,520,527
2,"Area, Ethnic, Cultural, and Gender Studies","2,629",0%,1040,536,504
3,Biological and Biomedical Sciences,"155,834",8%,1139,572,566
4,"Business, Management, Marketing, and Related S...","221,523",12%,1072,534,537

is there any null values ?

In [94]:
df2.isnull().sum()

intended_college_major    0
test_takers               0
percent                   0
total                     0
reading_writing           0
math                      0
dtype: int64

apparently not ! let's check the data type !

In [95]:
df2.dtypes

intended_college_major    object
test_takers               object
percent                   object
total                      int64
reading_writing            int64
math                       int64
dtype: object

Alright, the test takers column should be numerical; the percent should be float !

First let's change the columns names so everything is lowercased with no space

In [96]:
df2.rename( columns = {'IntendedCollegeMajor':'intended_college_major', 'TestTakers': 'test_takers', 'Percent':'percent',
                       'Total':'total', 'ReadingWriting': 'reading_writing', 'Math':'math'} , inplace = True)

In [97]:
df2.head(2)

,intended_college_major,test_takers,percent,total,reading_writing,math
0,"Agriculture, AgricultureOperations, and Relate...","24,913",1%,977,496,481
1,Architecture and Related Services,"28,988",2%,1047,520,527

New columns names !! Now let's do some conversion, first the test_takers:

to convert it to integers we need to remove the commas !

In [98]:
df2['test_takers'] = df2['test_takers'].str.replace(',','')

In [99]:
df2.head(2)

,intended_college_major,test_takers,percent,total,reading_writing,math
0,"Agriculture, AgricultureOperations, and Relate...",24913,1%,977,496,481
1,Architecture and Related Services,28988,2%,1047,520,527

No more commas; let's turn the column into a int type

In [100]:
df2['test_takers'] = df2['test_takers'].astype('int64')

In [101]:
df2.dtypes

intended_college_major    object
test_takers                int64
percent                   object
total                      int64
reading_writing            int64
math                       int64
dtype: object

let's turn the percent column to float; first let's remove the % sign

In [102]:
df2['percent'] = df2['percent'].str.replace('%','')

In [103]:
df2.head(2)

,intended_college_major,test_takers,percent,total,reading_writing,math
0,"Agriculture, AgricultureOperations, and Relate...",24913,1,977,496,481
1,Architecture and Related Services,28988,2,1047,520,527

now let's convert the percent column to float:

In [104]:
df2['percent'] = df2['percent'].astype('float')

In [106]:
df2['percent'] = df2['percent'].div(100)

In [105]:
df2.dtypes

intended_college_major     object
test_takers                 int64
percent                   float64
total                       int64
reading_writing             int64
math                        int64
dtype: object

Are the reading writting and the math columns relevant ?

# Data Dictionary

|Feature     | Type      | dataset   | Description          |
|------------|-----------|-----------|----------------------|
|  school    | object    |  df_1 (sat_act_by_college) | Name of the college| 
  applies_class_years | object |  df_1 (sat_act_by_college) | years in which the policies apply to 
  policy_details | object | df_1 (sat_act_by_college) | requirements per colleges for acceptance
  number_of_applicants | int64 | df_1 (sat_act_by_college) | number of person that applied to this particular college
  accept_rate | float | df_1 (sat_act_by_college) | The rate of acceptance for each colleges
  sat_total_25th_percentile | float | df_1 (sat_act_by_college) |25th percentile SAT score for each colleges
  sat_total_75th_percentile | float | df_1 (sat_act_by_college) |75th percentile SAT score for each colleges
  act_total_25th_percentile | float | df_1 (sat_act_by_college) |25th percentile ACT score for each colleges
  act_total_75th_percentile	| float | df_1 (sat_act_by_college) |75th percentile ACT score for each colleges